## Plan Result (sds_stg_ado)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.mi_polybasestaging_owner[0]
* Update
  * azurerm_user_assigned_identity.azure-devops-mi




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.mi_polybasestaging_owner[0] will be created
  + resource "azurerm_role_assignment" "mi_polybasestaging_owner" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "26f5a1bd-d791-4a08-9662-5babd1c3a903"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/mi-stg-rg/providers/Microsoft.Storage/storageAccounts/mipolybasestagingstg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.azure-devops-mi will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "azure-devops-mi" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/azure-devops-stg-mi"
        name                = "azure-devops-stg-mi"
      ~ tags                = {
          ~ "criticality"  = "Low" -> "High"
          ~ "environment"  = "development" -> "staging"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":8,"Program":"tfcmt","SHA1":"","Target":"sds_stg_ado","Vars":{}} -->